[
  "A detailed, hyper-realistic studio portrait of {pet_description} sitting upright on a velvet cushion, wearing a tiny monocle and looking directly at the camera with an expression of mild disdain. The background is a dimly lit mahogany library.",
  "A minimalist vector art illustration of {pet_description} floating in space next to a tiny, stylized planet. The color palette is restricted to three bright, flat colors: turquoise, coral, and white.",
  "A vibrant, psychedelic blacklight poster style depiction of {pet_description} performing a radical guitar solo on a stage illuminated by swirling neon lights and surrounded by glowing mushrooms.",
  "A highly detailed, intricate woodcut engraving style image featuring {pet_description} dressed as a medieval alchemist, hunched over a bubbling flask on a cluttered workbench in a dark stone tower.",
  "A cinematic, high-contrast black and white photograph of {pet_description} running dramatically across a desolate, foggy beach at sunrise, captured in sharp focus with motion blur suggesting speed.",
  "A pastel-colored, dreamy watercolor painting of {pet_description} relaxing in a giant teacup floating gently among soft clouds. The style is reminiscent of children's storybook illustrations from the 1940s.",
  "A complex 3D render, Pixar movie style, showing {pet_description} standing triumphantly atop a massive pile of shredded toilet paper, illuminated by a single spotlight in an otherwise dark room.",
  "A Japanese Ukiyo-e woodblock print featuring {pet_description} balancing gracefully on a thin tree branch overlooking Mount Fuji. The composition emphasizes bold outlines and flat areas of traditional muted color.",
  "An avant-garde, cubist inspired painting where {pet_description} is deconstructed into geometric shapes and fractured planes, incorporating elements of newspapers and rough textures, dominated by earth tones and blues.",
  "A nostalgic, highly saturated 1980s VHS filter photo of {pet_description} wearing neon spandex and leg warmers, striking a confident power pose in front of a glowing grid background."
]