[
  "A photorealistic, highly detailed image of {pet_description} dressed in a tiny business suit, meticulously filling out a tax form with a quill pen at an antique mahogany desk. Cinematic lighting, deep focus.",
  "A hyper-realistic photo of {pet_description} frantically typing on a mechanical keyboard in a chaotic office cubicle, surrounded by stacks of paper and coffee cups. The screen code is visible in the reflection of their eyes.",
  "A moody, cinematic film still depicting {pet_description} in a chef's hat, stirring a massive pot of soup on a professional stainless-steel stove in a gourmet kitchen, looking stressed and slightly disgruntled. Ultra-realistic texture detail.",
  "A stylized, vaporwave aesthetic image of {pet_description} wearing a tracksuit and heavy gold chains, dramatically lifting miniature barbell weights in a neon-lit 80s gym. Bold colors, low-poly rendering.",
  "A highly detailed digital painting in the style of Hieronymus Bosch showing {pet_description} wearing medieval clothing, engaged in a fierce, high-stakes game of chess against a tiny knight figurine on an oversized, cluttered table.",
  "A cute, Chibi-style Japanese art illustration of {pet_description} riding a tiny, bright red unicycle across a tightrope strung between two skyscrapers, holding a tiny balancing umbrella. Clear blue sky background.",
  "A surrealist photograph inspired by Magritte, featuring {pet_description} wearing a bowler hat, holding a briefcase, and rushing out the front door of a suburban house, looking anxiously at a wristwatch. Dreamlike, soft focus.",
  "A striking, monochromatic ink wash painting of {pet_description} perched precariously on a high branch, serenading a flock of pigeons using a tiny, intricately detailed acoustic guitar. Traditional Asian brushwork style.",
  "A polished, low-angle studio photograph of {pet_description} dressed as a rock star, aggressively smashing a miniature drum kit with tiny drumsticks on a stage under a dramatic spotlight. Shallow depth of field, high contrast.",
  "A charming, pastel-colored watercolor illustration of {pet_description} relaxing in a miniature claw-foot bathtub, wearing a tiny shower cap, holding a rubber duck, and reading a paperback novel by candlelight."
]