[
  "A viral, cinematic still, highly saturated and dramatic, depicting {pet_description} looking skeptically over a pair of tiny, round sunglasses, captioned 'When the human says 'just a minute''.",
  "A surrealist Salvador Dalí-inspired oil painting where {pet_description} is stretched out and melting over a non-Euclidean landscape, conveying peak existential dread about bath time. High detail, moody lighting.",
  "A vibrant, low-poly 3D render, minimalist and brightly colored, of {pet_description} floating serenely in space wearing an astronaut helmet, holding a single, glowing tennis ball. Caption: 'My focus during meetings.'",
  "A highly detailed, anthropomorphic storybook illustration in the style of Beatrix Potter, showing {pet_description} dressed in tweed attire, meticulously attempting to brew a cup of tea but spilling it everywhere. Victorian aesthetic.",
  "A stylized Japanese Ukiyo-e woodblock print featuring {pet_description} dramatically battling a laser pointer, rendered with bold lines and traditional wave patterns. Text overlay in kanji translating to 'The Dance of the Red Dot'.",
  "A hyper-realistic photo taken with a fisheye lens from the perspective of a treat bag, showing {pet_description} with wide, pleading eyes and open mouth, surrounded by chaotic energy. Professional studio lighting.",
  "A retro 1950s comic book panel, drawn with thick black linework and limited halftone colors (red, yellow, black), where {pet_description} is shouting an exaggerated complaint into a tiny telephone, yelling 'I demand more belly rubs, NOW!'",
  "A complex, biomechanical steampunk illustration of {pet_description}, where parts of its fur/feathers are replaced with polished brass gears and clockwork mechanisms, looking utterly bored while operating a tiny, intricate lever.",
  "A digital painting in the style of a medieval illuminated manuscript, gold leaf highly visible, illustrating {pet_description} as a royal figure lazily demanding snacks from a kneeling peasant (human hand).",
  "A goofy, exaggerated character design in the style of 1990s Nicktoons (e.g., Ren & Stimpy), showing {pet_description} having an extreme, over-the-top reaction to the sound of a doorbell, with speed lines and chaotic, rubber-hose limbs."
]